{
	"aboutInfo": ["I am a curious frontend developer from Stockholm with an interest for reusable and dynamic code, always looking for new ways to grow. I am not afraid to take on a challenge, and I believe with a little bit of grit, (almost) anything is possible.", "My ultimate goal is to always keep learning. I value structure and organization in my life, which is something I always bring to my work and studies. Naturally, this leads to a will to structure and modularize my code — which is why I love React and CSS.", "Apart from coding, I get immersed in video games, crocheting and drawing. I think the reason I am drawn to frontend development in particular is that I get to combine my structured and organized nature with my artistic and creative spirit. The end product is something like this portfolio — shooting for the stars and landing on the moon; ambition beyond the skills i possessed when starting, but getting there."],
	"projectsInfo": [{
			"id": "1",
			"title": "Pokémon Memory Game",
			"description": "A memory game made with JavaScript, Html, and CSS. We fetch 8 random Pokémon, duplicate them to create pairs, and then hide them. Scores are stored in the browsers local storage as the time it takes the player to complete, paired with the date and their submitted name.",
			"bulletpoints": ["JavaScript", "browser storage", "API fetching"],
			"image": "/projectImages/pokemon.png",
			"github": true,
			"deployed": true,
			"githubLink": "https://github.com/Kristallers/PokeMon-Memory-Game-Ester",
			"deployedLink": "https://pokemon-memorygame.netlify.app/"
		},
		{
			"id": "2",
			"title": "Chat app",
			"description": "A fullstack project where users can send chat messages. Messages are stored in a postgreSQL database, which is hosted on Aiven. The API is built using express.js with sequelize as the ORM. The frontend is React based.",
			"bulletpoints": ["REST API", "node.js", "express.js", "React.js"],
			"image": "/projectImages/chat.png",
			"github": true,
			"deployed": false,
			"githubLink": "https://github.com/mxrmrtz/open-chat",
			"deployedLink": ""
		},
		{
			"id": "3",
			"title": "This portfolio",
			"description": "This started as a complete beginner three.js experimentation project but quickly turned into an obsession. The spheres are generated using three.js geometry, and the stars are accredited to 3D artist Wayne Pearce on sketchfab.com. I've gotten to explore ways of positioning 3D objects in three.js, animating cameras as well as endless googling.",
			"bulletpoints": ["Next.js", "Three.js/React three fiber"],
			"image": "/projectImages/portfolio.png",
			"github": true,
			"deployed": true,
			"githubLink": "https://github.com/Kristallers/ester-cortes-portfolio",
			"deployedLink": "https://ester-cortes.vercel.app" 
		}]
}

